config/language-modes/gtags.org
#+title: GTags Configuration
#+author: Jeff Farr
#+property: header-args:emacs-lisp :tangle gtags.el
#+auto_tangle: y

* Introduction
This file configures GTags (GNU Global) integration for Emacs, providing code navigation and indexing capabilities for various programming languages.

* Basic Configuration
Setup lexical binding for better closures and variable scoping.

#+begin_src emacs-lisp
;; -*- lexical-binding: t; -*-
#+end_src

* Git Hook Configuration
Set up automatic tag generation on Git commits.

#+begin_src emacs-lisp
(defun create-tags-git-hook ()
  "Append ctags update command to git post-commit hook."
  (let* ((project-root (projectile-project-root))
         (hook-path (concat project-root ".git/hooks/post-commit"))
         (shebang "#!/bin/sh")
         (command "\n# auto-generated by emacs create-tags-git-hook\nglobal -u\n"))
    (when project-root
      (if (file-exists-p hook-path)
          (let ((existing-content (with-temp-buffer
                                    (insert-file-contents hook-path)
                                    (buffer-string))))
            (unless (string-match-p (regexp-quote command) existing-content)
              (append-to-file command nil hook-path)))
        (with-temp-file hook-path
          (insert shebang command))
        (set-file-modes hook-path #o755)))))

(defadvice projectile-switch-project-by-name (after create-git-hook activate)
  "Create a git post-commit hook to update ctags every time a project is opened."
  (create-tags-git-hook))

(defadvice projectile-switch-open-project (after create-git-hook activate)
  "Create a git post-commit hook to update ctags every time a project is opened."
  (create-tags-git-hook))

(defadvice projectile-switch-project (after create-git-hook activate)
  "Create a git post-commit hook to update ctags every time a project is opened."
  (create-tags-git-hook))

(defadvice consult-projectile-switch-project (after create-git-hook activate)
  "Create a git post-commit hook to update ctags every time a project is opened."
  (create-tags-git-hook))
#+end_src

* GTags Mode Configuration
Configure GTags for various programming languages.

#+begin_src emacs-lisp
(use-package ggtags
  :straight t)

(add-hook 'python-mode-hook
        (lambda ()
          (ggtags-mode 1)))

(add-hook 'js-mode-hook
        (lambda ()
          (ggtags-mode 1)))

(setenv "GTAGSLABEL" "pygments")
#+end_src

* GTags Display Configuration
Configure how GTags displays its results to preserve window layouts.

#+begin_src emacs-lisp
;; Configure how ggtags displays its results
(setq display-buffer-alist
      '(("\\*ggtags-global\\*"
         (display-buffer-reuse-window display-buffer-in-side-window)
         (side . bottom)
         (window-height . 0.3)
         (select-window . t))))

;; (defun my-ggtags-focus-window ()
;;   "Automatically select the ggtags results window."
;;   (let ((ggtags-window (get-buffer-window "*ggtags-global*")))
;;     (when ggtags-window
;;       (select-window ggtags-window))))

;; ;; Hook to focus the ggtags window after a search
;; (add-hook 'ggtags-find-tag-hook 'my-ggtags-focus-window)
#+end_src

* Automatic Tag Updates
Configure auto-incremental updates to tags on file save.

#+begin_src emacs-lisp
; this config cargo culted from https://www.emacswiki.org/emacs/GnuGlobal
(defun gtags-root-dir ()
    "Returns GTAGS root directory or nil if doesn't exist."
    (with-temp-buffer
      (if (zerop (call-process "global" nil t nil "-pr"))
          (buffer-substring (point-min) (1- (point-max)))
        nil)))

(defun gtags-update ()
  "Make GTAGS incremental update"
  (call-process "global" nil nil nil "-u"))
#+end_src

* Single File Update on Save
Update tags for just the current file when saving.

#+begin_src emacs-lisp
(defun gtags-update-single(filename)  
  "Update Gtags database for changes in a single file"
  (interactive)
  (start-process "update-gtags" "update-gtags" "bash" "-c" (concat "cd " (gtags-root-dir) " ; gtags --single-update " filename )))

(defun gtags-update-current-file()
  (interactive)
  (defvar filename)
  (setq filename (replace-regexp-in-string (gtags-root-dir) "." (buffer-file-name (current-buffer))))
  (gtags-update-single filename)
  (message "Gtags updated for %s" filename))

(defun gtags-update-hook()
  "Update GTAGS file incrementally upon saving a file"
  (when (gtags-root-dir)
    (gtags-update-current-file)))

;(add-hook 'after-save-hook #'gtags-update-hook)
#+end_src

* Installation Instructions
This configuration depends on having GTags (GNU Global) installed on your system.

For macOS, install with Homebrew:
#+begin_src sh :tangle no
brew install global
#+end_src

* Usage Notes
** Setting Up a New Project
To set up GTags in a new project:

1. Navigate to the project root directory
2. Run: `gtags` to generate the initial tag files
3. When opening the project in Emacs, the post-commit hook will be automatically created

** Basic Commands
- `M-.` or `ggtags-find-tag-dwim`: Find tag under cursor
- `M-,` or `ggtags-prev-mark`: Jump back to previous position
- `C-c g s` or `ggtags-find-other-symbol`: Find references
- `C-c g h` or `ggtags-view-tag-history`: View tag search history

** Git Integration
The configuration automatically sets up a Git post-commit hook to update tags after each commit.

To manually set up the hook:
#+begin_src sh :tangle no
cat << EOF > .git/hooks/post-commit
#!/bin/sh
global -u
EOF

chmod +x .git/hooks/post-commit
#+end_src

* TODO Improvements
- Add support for more programming languages
- Consider integrating with LSP for modern code navigation
- Improve window management for tag search results
- Enable automatic tag updates on file save for specific modes